PROC 0 L(&SYSUID)  G(SAVE)  S(NO)
 /*                                                         */
 /* Quick ISPF save of data set names. This is much quicker */
 /* than using OPT 3.4, because it does not do an obtain    */
 /* for each data set in the list because of STATS(NO).     */
 /* The dsn created will be USERID.SAVE.DATASETS            */
 /*                                                         */
 ISPEXEC CONTROL ERRORS RETURN
 ISPEXEC LMDINIT LISTID(LISTID)  LEVEL(&L)
 ISPEXEC LMDLIST LISTID(&LISTID) OPTION(SAVE) STATS(&S) GROUP(&G)
 WRITE COMPLETE!! RETURN CODE WAS &LASTCC
 WRITE OUTPUT IS IN &SYSUID..&G..DATASETS
 ISPEXEC LMDFREE LISTID(&LISTID)
